Repository: Agrathejagged/tenora-works
Catalog: WPFHexaEditor/Properties/Resources.*.resx
Languages: fr_ca, pl_pl, pt_br, ru_ru, zh_cn

# AppendByteConfirmationString
source: You have reached the end of file. Do you want append one byte ? This operation cannot be canceled if you continue.
fr_ca: Vous avez atteint la fin du fichier. Voulez-vous ajouter un octet? Cette opération ne peut pas être annulée si vous continuez.
pl_pl: Osiągnąłeś koniec pliku. Czy chcesz dołączyć jeden bajt? Ta operacja nie może zostać anulowana, jeśli kontynuujesz.
pt_br: Você chegou ao final do arquivo. Deseja anexar um byte? Esta operação não pode ser cancelada se você continuar.
ru_ru: Достигнут конец файла. Добавить байт? Эта операция не может быть отменена.
zh_cn: 已到达文件末尾，你想要追加一个字节吗？ 继续将无法取消此操作。

# BookmarksString
source: Bookmarks
fr_ca: Signets
pl_pl: Zakładki
pt_br: Favoritos
ru_ru: Закладки
zh_cn: 标记

# ByteActionString
source: Byte action
fr_ca: Action sur l'octet
pt_br: Ação de bytes
ru_ru: Байт действия
zh_cn: 状态

# ByteString
source: Byte
fr_ca: Octets
pl_pl: Bajt
ru_ru: Байт
zh_cn: 值(字节)

# CancelLongProcessString
source: Cancel long process
fr_ca: Annuler le long processus
pl_pl: Anuluj długi proces
pt_br: Cancelar o processo longo
ru_ru: Отменить длительный процесс
zh_cn: 取消当前工作

# CancelLongProcessToolTipString
source: Click to cancel long process.
fr_ca: Cliquez pour annuler le processus long.
pl_pl: Kliknij, aby anulować długi proces.
pt_br: Clique para cancelar o longo processo.
ru_ru: Нажмите, чтобы отменить длительный процесс.
zh_cn: 点击以取消当前的工作

# CancelString
source: Cancel
fr_ca: Annuler
pl_pl: Anuluj
pt_br: Cancelar
ru_ru: Отмена
zh_cn: 取消

# ClearBookMarkString
source: Clear bookmark
fr_ca: Supprimer les signets
pl_pl: Wyczyść zakładki
pt_br: Clear Markker
ru_ru: Очистить закладку
zh_cn: 清除标记

# ClearString
source: Clear
fr_ca: Effacer
ru_ru: Очистить
zh_cn: 明确

# ClickToGoAtPositionString
source: Click to go to at position.
fr_ca: Cliquez pour aller à la position.
pl_pl: Kliknij, aby przejść do pozycji.
pt_br: Clique para ir para a posição.
ru_ru: Нажмите, чтобы перейти на позицию.
zh_cn: 点击以跳转

# CloseString
source: Close
fr_ca: Fermer
pt_br: Fechar
ru_ru: Закрыть
zh_cn: 关闭

# CopyAsASCIIString
source: Copy as ASCII
fr_ca: Copie en ASCII
pl_pl: Skopiuj jako ASCII
pt_br: Copie como ASCII
ru_ru: Скопировать как ASCII
zh_cn: ASCII

# CopyAsDecimalString
source: Copy as decimal
fr_ca: Copier la valeur décimal
pl_pl: Kopiuj jako dziesiętny
pt_br: Copiar como decimal
ru_ru: Копировать как десятичное число
zh_cn: 十进制

# CopyAsHexadecimalString
source: Copy as hexadecimal
fr_ca: Copie en hexadecimal
pl_pl: Skopiuj jako szesnastkowy
pt_br: Copiar como hexadecimal
ru_ru: Копировать как шестнадцатеричное число
zh_cn: 十六进制

# CopyAsTBLString
source: TBL string (character file loaded)
fr_ca: Chaîne TBL (fichier de caractères chargé)
pl_pl: Ciąg TBL (plik z załadowanymi znakami)
pt_br: Cadeia TBL (arquivo de caracteres carregado)
ru_ru: TBL (загруженный файл символов)
zh_cn: TBL (需加载TBL文件)

# CopySelectionAsString
source: Copy selection as ...
fr_ca: Copier la selection en ...
pl_pl: Skopiuj zaznaczenie jako ...
pt_br: Copie a seleção como ...
ru_ru: Копировать выделенное как...
zh_cn: 复制选中内容为...

# CountOfString
source: Count of
fr_ca: Quantiter de
pl_pl: Liczyć
pt_br: Contagem de
ru_ru: Количество
zh_cn: 字节数

# DefaultTBLString
source: Default TBL
fr_ca: TBL par défaut
pl_pl: Domyślny TBL
pt_br: TBL padrão
ru_ru: По умолчанию TBL
zh_cn: 默认TBL

# DeleteString
source: Delete
fr_ca: Supprimer
pl_pl: Kasować
pt_br: Excluir
ru_ru: Удалить
zh_cn: 删除

# DescriptionString
source: Description
pl_pl: Opis
pt_br: Descrição
ru_ru: Описание
zh_cn: 描述

# EnterHexValueMsgString
source: Enter hexadecimal value ...
fr_ca: Entrer une valeur hexadecimal ...
pl_pl: Wprowadź wartość szesnastkową ...
pt_br: Digite o valor hexadecimal ...
ru_ru: Введите шестнадцатеричное значение...
zh_cn: 请输入十六进制值

# FileDroppingConfirmationString
source: Do you want close the current file and open :
fr_ca: Voulez-vous fermer le fichier actuel et ouvrir :
pl_pl: Czy chcesz zamknąć bieżący plik i otworzyć:
pt_br: Deseja fechar o arquivo atual e abrir:
ru_ru: Вы хотите закрыть текущий файл и открыть:
zh_cn: 你想关闭当前文件并打开：

# FillSelectionAloneString
source: Fill selection with byte
fr_ca: Remplir la sélection avec un octet
pl_pl: Wypełnij wybór bajtem
pt_br: Preencha a seleção de bytes
ru_ru: Заполните выбор байтом
zh_cn: 填充选定区域(字节)

# FillSelectionString
source: Fill selection with byte...
fr_ca: Remplir la sélection avec l'octet ...
pl_pl: Wypełnij bajt wyboru ...
pt_br: Preencha a seleção de bytes...
ru_ru: Заполните выбор байтом...
zh_cn: 填充选定区域(字节)

# FindAllString
source: Find All
fr_ca: Tout
pl_pl: Znajdź wszystko
pt_br: Encontrar tudo
ru_ru: Bce
zh_cn: 找到所有

# FindAndReplaceString
source: Find and Replace
fr_ca: Rechercher et Remplacer
pl_pl: Znajdź i zamień
pt_br: Localizar e substituir
ru_ru: Найти и заменить
zh_cn: 查找和替换

# FindByteString
source: Byte to search
fr_ca: Octet à rechercher
pt_br: Byte para pesquisar
ru_ru: Байт для поиска
zh_cn: 搜索的字节值

# FindFirstString
source: Find First
fr_ca: Rechercher
pl_pl: Znajdź pierwszy
pt_br: Encontre primeiro
ru_ru: Найти первый
zh_cn: 查找首个

# FindLastString
source: Find Last
fr_ca: Dernier
pl_pl: Znajdź ostatni
ru_ru: Найти последний
zh_cn: 查找最后一个

# FindNextString
source: Find Next
fr_ca: Suivant
pl_pl: Znajdź następny
pt_br: Encontre o próximo
ru_ru: Найти следующий
zh_cn: 查找下一个

# FindSelectionString
source: Find all occurence of selection
fr_ca: Trouver toutes les occurrences de la sélection
pl_pl: Znajdź wszystkie wystąpienia zaznaczenia
pt_br: Encontre todas as ocorrências de seleção
ru_ru: Найти все случаи отбора
zh_cn: 查找选定的字符串

# FindString
source: Find
fr_ca: Rechercher
pl_pl: Odnaleźć
pt_br: Encontrar
ru_ru: Найти
zh_cn: 查找

# FindWhatString
source: Find what:
fr_ca: Rechercher quoi:
pl_pl: Znajdź co:
pt_br: Encontre o que:
ru_ru: Найти:
zh_cn: 查找：

# FirstByteString
source: First byte
fr_ca: Premier octet
pl_pl: Pierwszy bajt
pt_br: Primeiro byte
ru_ru: Первый байт
zh_cn: 首字节

# HexString
source: Hex
zh_cn: 十六进制

# HighLightSettingString
source: Highlight all data find
fr_ca: Mettez en surbrillance toutes les données trouvées
pl_pl: Zaznacz wszystkie znalezione dane
pt_br: Realce todos os dados encontrados
ru_ru: Выделить все найденные данные
zh_cn: 突出显示所有数据查找

# LengthString
source: Length
fr_ca: Taille
pl_pl: Długość
pt_br: comprimento
ru_ru: Длинна
zh_cn: 字节长度

# LineStatusBarTagString
source: Ln
fr_ca: Lg
zh_cn: 行

# LongString
source: Long
pl_pl: Długie
pt_br: Longo
zh_cn: 长度

# OkString
source: Ok
ru_ru: ОК
zh_cn: 确定

# PasteExtendByteConfirmationString
source: Paste operation reached the end of file. Do you want extend the file for complete operation ? This operation cannot be canceled if you continue.
fr_ca: L'opération de collage a atteint la fin du fichier. Voulez-vous étendre le fichier pour une opération complète? Cette opération ne peut pas être annulée si vous continuez.
pl_pl: Wklej dotarł do końca pliku. Czy chcesz przedłużyć plik do pełnej pracy? Ta operacja nie może zostać anulowana, jeśli kontynuujesz.
pt_br: A operação de colar atingiu o final do arquivo. Deseja estender o arquivo para operação completa? Esta operação não pode ser cancelada se você continuar.
ru_ru: Операция вставки достигла конца файла. Расширить файл для завершения операции? Эта операция не может быть отменена.
zh_cn: 粘贴操作到达文件的末尾。 你想扩展文件的完整操作吗？ 继续将无法取消此操作。

# PasteFromClipboardString
source: Paste from clipboard
fr_ca: Coller du presse-papiers
pl_pl: Wklej ze schowka
pt_br: Colar da área de transferência
ru_ru: Вставить из буфера обмена
zh_cn: 从剪贴板粘贴

# PasteNotInsertString
source: Paste without inserting
fr_ca: Coller sans insérer
pl_pl: Wklej bez wstawiania
pt_br: Cole sem inserir
ru_ru: Вставить без вставки
zh_cn: 粘贴(替换)

# PositionString
source: Position
pl_pl: Pozycja
pt_br: Posição
ru_ru: Позиция
zh_cn: 位置

# ReplaceAllString
source: Replace All
fr_ca: Remplacer tout
pl_pl: Zmień wszystko
pt_br: Substitua tudo
ru_ru: Заменить всe
zh_cn: 全部替换

# ReplaceByByteString
source: Replace by byte
fr_ca: Remplacer par l'octet
pl_pl: Wymień bajt
pt_br: Substitua por byte
ru_ru: Заменить байтом
zh_cn: 替换字节

# ReplaceNextString
source: Replace Next
fr_ca: Remplacer suivant
pl_pl: Zamień na następny
pt_br: Substitua Próximo
ru_ru: Заменить следующие
zh_cn: 替换下一个

# ReplaceSelectionString
source: Replace byte in selection...
fr_ca: Remplacer un octet dans la sélection ...
pl_pl: Zastąp bajt w zaznaczeniu ...
pt_br: Substituir byte na seleção ...
ru_ru: Заменить байт в выборе...
zh_cn: 替换选中的字符串

# ReplaceString
source: Replace
fr_ca: Remplacer
pl_pl: Zastąpić
pt_br: Substituir
ru_ru: Заменить
zh_cn: 更替

# ReplaceTrimSettingString
source: Trim the data on the find length when replace
fr_ca: Couper les données sur la longueur de la recherche lors du remplacement
pl_pl: Przytnij dane na długości wyszukiwania po wymianie
pt_br: Apare os dados no comprimento de localização quando substituir
ru_ru: Обрезать данные по длине нахождения при замене
zh_cn: 更换时修剪查找长度的数据

# ReplaceWithByteString
source: Replace with byte
fr_ca: Remplacer un octet
pl_pl: Zmień na bajt
pt_br: Substitua por byte
ru_ru: Заменить байт
zh_cn: 用字节替换

# ReplaceWithString
source: Replace with:
fr_ca: Remplacer par :
pl_pl: zastąpić:
pt_br: Substituir com:
ru_ru: Заменить:
zh_cn: 用字符串替换：

# SelectAllString
source: Select all
fr_ca: Selectionner tout
pl_pl: Zaznacz wszystko
pt_br: Selecionar tudo
ru_ru: Выделить все
zh_cn: 全选

# SetBookMarkString
source: Set bookmark
fr_ca: Définir un signet
pl_pl: Ustaw zakładkę
ru_ru: Установить закладку
zh_cn: 标记

# ThisStringAreNotHexString
source: This string are not hex
fr_ca: Cette chaine n'est pas hexadecimal
pl_pl: Ten ciąg nie jest szesnastkowy
pt_br: Esta cadeia não é hexadecimal
ru_ru: Эта строка не является шестнадцатеричной
zh_cn: 非有效的十六进制格式

# UndoString
source: Undo
fr_ca: Annuler
pl_pl: Cofnij
pt_br: Desfazer
ru_ru: Отменить
zh_cn: 撤销

# ValueString
source: Value
fr_ca: Valeur
pl_pl: Wartość
pt_br: Valor
ru_ru: Значение
zh_cn: 值

# WritingErrorExeptionString
source: An error is occurs when writing.
fr_ca: Une erreur est survenue lors de l'écriture.
pl_pl: Wystąpił błąd podczas pisania.
pt_br: Há uma escrita de erro.
ru_ru: При записи произошла ошибка.
zh_cn: 写入错误

# ZoomResetString
source: Reset zoom to 100%
fr_ca: Réinitialiser le zoom à 100%
pl_pl: Zresetuj zoom do 100%
pt_br: Redefinir zoom para 100%
ru_ru: Сбросить масштаб до 100%
zh_cn: 将缩放重置为100％

# ZoomString
source: Zoom
pl_pl: Powiększenie
ru_ru: Увеличить
zh_cn: 放大

# EndTagString
source: <end>
fr_ca: <Fin>

# KBTagString
source: Kb
fr_ca: Ko

# LineTagString
source: <ln>
fr_ca: <lg>

# MBTagString
source: Mb
fr_ca: Mo
